In [3]:
import pandas as pd

df = pd.read_csv("salary.csv", delimiter = ';', header = None)
df.rename(columns = {0: 'idx', 1: 'Country', 2: 'Salary', 3: 'Currency', 4: 'Salary[USD]'}, inplace = True)
#df.sort_index()
#and then return?

   idx         Country    Salary Currency  Salary[USD]
0  1.0     Afghanistan   91969.0      AFN       1175.0
1  2.0   Aland Islands    4296.0      EUR       4715.0
2  3.0         Albania  110594.0      ALL        989.0
3  4.0         Algeria  258324.0      DZD       2147.0
4  5.0  American Samoa    1847.0      USD         15.0